In [15]:
import pandas as pd

In [16]:
df=pd.read_csv("dog.csv")

In [17]:
df.head()

,HALTER_ID,ALTER,GESCHLECHT,STADTKREIS,STADTQUARTIER,RASSE1,RASSE1_MISCHLING,RASSE2,RASSE2_MISCHLING,RASSENTYP,GEBURTSJAHR_HUND,GESCHLECHT_HUND,HUNDEFARBE
0,126,51-60,m,9.0,92.0,Welsh Terrier,NaN,NaN,NaN,K,2011,w,schwarz/braun
1,574,61-70,w,2.0,23.0,Cairn Terrier,NaN,NaN,NaN,K,2002,w,brindle
2,695,41-50,m,6.0,63.0,Labrador Retriever,NaN,NaN,NaN,I,2012,w,braun
3,893,61-70,w,7.0,71.0,Mittelschnauzer,NaN,NaN,NaN,I,2010,w,schwarz
4,1177,51-60,m,10.0,102.0,Shih Tzu,NaN,NaN,NaN,K,2011,m,schwarz/weiss

In [18]:
df["GESCHLECHT"].value_counts()

GESCHLECHT
w    4782
m    2198
Name: count, dtype: int64

In [19]:
# group by
grp=df.groupby("GESCHLECHT")['STADTQUARTIER'].mean()

In [20]:
grp

GESCHLECHT
m    76.106557
w    77.091384
Name: STADTQUARTIER, dtype: float64

In [21]:
# pivot

dff=pd.pivot_table(df,values='STADTQUARTIER',index='HALTER_ID',columns='GESCHLECHT',aggfunc='mean')

In [22]:
dff

GESCHLECHT      m     w
HALTER_ID
126          92.0   NaN
574           NaN  23.0
695          63.0   NaN
893           NaN  71.0
1177        102.0   NaN
...           ...   ...
128462        NaN  52.0
128471        NaN  83.0
128479        NaN  63.0
128482        NaN  91.0
128485        NaN  74.0

[6314 rows x 2 columns]

In [39]:
data = {
    'User': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice','Alice','ram'],
    'Product': ['Shoes', 'Shoes', 'Shirt', 'Shirt', 'Shoes', 'Shirt','Shoes','pant'],
    'Amount': [2500, 2200, 1500, 1600, 3000, 1800,9999,787878]
}

df = pd.DataFrame(data)
print(df)

dff=pd.pivot_table(df,index='User',columns='Product',values='Amount',aggfunc='mean')

      User Product  Amount
0    Alice   Shoes    2500
1      Bob   Shoes    2200
2    Alice   Shirt    1500
3      Bob   Shirt    1600
4  Charlie   Shoes    3000
5    Alice   Shirt    1800
6    Alice   Shoes    9999
7      ram    pant  787878

In [40]:
dff

Product   Shirt   Shoes      pant
User
Alice    1650.0  6249.5       NaN
Bob      1600.0  2200.0       NaN
Charlie     NaN  3000.0       NaN
ram         NaN     NaN  787878.0

MERGE FUN

In [41]:
df_left = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Right DataFrame (B)
df_right = pd.DataFrame({
    'ID': [2, 3, 4],
    'Score': [88, 92, 75]
})

In [42]:
pd.merge(df_left,df_right,on='ID',how='inner')

   ID     Name  Score
0   2      Bob     88
1   3  Charlie     92

In [43]:
pd.merge(df_left,df_right,on='ID',how='left')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   88.0
2   3  Charlie   92.0

In [44]:
pd.merge(df_left,df_right,on='ID',how='right')

   ID     Name  Score
0   2      Bob     88
1   3  Charlie     92
2   4      NaN     75

In [45]:
pd.merge(df_left,df_right,on='ID',how='outer')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   88.0
2   3  Charlie   92.0
3   4      NaN   75.0

In [54]:
jan_sales = pd.DataFrame({
    'Product': ['A', 'B'],
    'Sales': [100, 150]
})

# February sales data
feb_sales = pd.DataFrame({
    'Product': ['A', 'B'],
    'Sales': [120, 180]
})

mar_sales = pd.DataFrame({
    'Product': ['A', 'C'],
    'Sales': [199, 160]
})

In [57]:
conc=pd.concat([jan_sales,feb_sales,mar_sales],axis=1,ignore_index=True)

In [58]:
conc

   0    1  2    3  4    5
0  A  100  A  120  A  199
1  B  150  B  180  C  160

In [67]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df3 = pd.DataFrame({'c': [8, 99]})

In [70]:
c=pd.concat([df1,df2,df3],axis=1)

In [71]:
c

   A  B   c
0  1  3   8
1  2  4  99